testing/Serverless-Artillery/test-users-userid-tasks.yml
config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
  target: "https://nsc-fun-dev-usw2-tsmtestfunction.azurewebsites.net/api/GetTasks?"
  phases:
    - duration: 300
      arrivalRate: 10
scenarios:
  - name: "Load testing get tasks"
    flow:
      - get:
          url: "/tasks"